## Pandas

#### Note:- ```Pandas always work on structured data```

#### St-1) ``Import Pandas library``

In [1]:
# importing pandas library
import pandas as pd
import  numpy as np

#### St-2) `Import dataset`

In [174]:
df = pd.read_csv('I:/Data_Science_Master_ineuron/Dataset/services.csv')

By **```Default```** Pandas will **``always consider 1st row of dataset as columns name.``**

In [175]:
df.head()

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN
2,3,3,NaN,NaN,NaN,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,NaN,...,NaN,"Geriatric Counseling, Older Adults, Gay, Lesbi...",NaN,Senior Peer Counseling,NaN,San Mateo County,active,Varies.,NaN,NaN
3,4,4,NaN,NaN,NaN,Apply by phone.,"Parents, children, families with problems of c...",Provides supervised visitation services and a ...,None,NaN,...,NaN,"INDIVIDUAL AND FAMILY DEVELOPMENT SERVICES, Gr...",NaN,Family Visitation Center,NaN,San Mateo County,active,No wait.,NaN,NaN
4,5,5,NaN,NaN,NaN,Phone for information.,Low-income working families with children tran...,Provides fixed 8% short term loans to eligible...,Eligibility: Low-income family with legal cust...,NaN,...,NaN,"COMMUNITY SERVICES, Speakers, Automobile Loans",NaN,Economic Self-Sufficiency Program,NaN,San Mateo County,active,NaN,NaN,NaN


**Q.1) How to know the column names in data-frame ?**

**Ans)** In order to know list of columns  in a data frame use... 
><span class="mark">**`Syntax :- dataframe.columns`**</span>

In [176]:
# checking the list of columns name in data frame
list(df.columns)

['id',
 'location_id',
 'program_id',
 'accepted_payments',
 'alternate_name',
 'application_process',
 'audience',
 'description',
 'eligibility',
 'email',
 'fees',
 'funding_sources',
 'interpretation_services',
 'keywords',
 'languages',
 'name',
 'required_documents',
 'service_areas',
 'status',
 'wait_time',
 'website',
 'taxonomy_ids']

**Q.2) How to know the data types of each columns ?**

**Ans)** In order to know the data types of each columns use...
><span class = 'mark'>**`Syntax:- dataframe.dtypes`**</span>

In [177]:
# Checknig data type of each columns
df.dtypes

id                           int64
location_id                  int64
program_id                 float64
accepted_payments           object
alternate_name              object
application_process         object
audience                    object
description                 object
eligibility                 object
email                       object
fees                        object
funding_sources             object
interpretation_services     object
keywords                    object
languages                   object
name                        object
required_documents          object
service_areas               object
status                      object
wait_time                   object
website                     object
taxonomy_ids                object
dtype: object

In [178]:
# Selecting a particular from a data frame
df['location_id']

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
20    21
21    22
22    22
Name: location_id, dtype: int64

In [179]:
type(df['location_id']) # Passing column name as a string

pandas.core.series.Series

In [180]:
df['location_id']

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9     10
10    11
11    12
12    13
13    14
14    15
15    16
16    17
17    18
18    19
19    20
20    21
21    22
22    22
Name: location_id, dtype: int64

In [181]:
df[['location_id']]

    location_id
0             1
1             2
2             3
3             4
4             5
5             6
6             7
7             8
8             9
9            10
10           11
11           12
12           13
13           14
14           15
15           16
16           17
17           18
18           19
19           20
20           21
21           22
22           22

In [182]:
type(df[['location_id']]) # passing column name in list

pandas.core.frame.DataFrame

In [183]:
# Selecting multiple columns 
df[['location_id','keywords']]

    location_id                                           keywords
0             1  ADULT PROTECTION AND CARE SERVICES, Meal Sites...
1             2  EMPLOYMENT/TRAINING SERVICES, Job Development,...
2             3  Geriatric Counseling, Older Adults, Gay, Lesbi...
3             4  INDIVIDUAL AND FAMILY DEVELOPMENT SERVICES, Gr...
4             5     COMMUNITY SERVICES, Speakers, Automobile Loans
5             6  ADULT PROTECTION AND CARE SERVICES, In-Home Su...
6             7  ADULT PROTECTION AND CARE SERVICES, Adult Day ...
7             8  ADULT PROTECTION AND CARE SERVICES, Meal Sites...
8             9  EDUCATION SERVICES, Library, Libraries, Public...
9            10  EDUCATION SERVICES, Library, Libraries, Public...
10           11  EDUCATION SERVICES, Library, Libraries, Public...
11           12  EDUCATION SERVICES, Adult, Alternative, Litera...
12           13  EDUCATION SERVICES, Library, Libraries, Public...
13           14  COMMUNITY SERVICES, Interpretation/Translation...
14           15  ALCOHOLISM SERVICES, Residential Care, DRUG AB...
15           16  COMMODITY SERVICES, Clothing/Personal Items, C...
16           17  COMMODITY SERVICES, Clothing/Personal Items, C...
17           18  HEALTH SERVICES, Outpatient Care, Community Cl...
18           19  HEALTH SERVICES, Outpatient Care, Community Cl...
19           20                                                NaN
20           21                                                NaN
21           22                                    Salud, Medicina
22           22         Ruby on Rails/Postgres/Redis, testing, wic

**Q.3) How to save data to your local machine ?**

**Ans)** In order to save any type of data use...         
><span class = 'mark'>**`Syntax:- dataframe.to_filetype()`**</span>

In [12]:
df.head(3)

,id,location_id,program_id,accepted_payments,alternate_name,application_process,audience,description,eligibility,email,...,interpretation_services,keywords,languages,name,required_documents,service_areas,status,wait_time,website,taxonomy_ids
0,1,1,NaN,NaN,NaN,Walk in or apply by phone.,"Older adults age 55 or over, ethnic minorities...",A walk-in center for older adults that provide...,"Age 55 or over for most programs, age 60 or ov...",NaN,...,NaN,"ADULT PROTECTION AND CARE SERVICES, Meal Sites...",NaN,Fair Oaks Adult Activity Center,NaN,Colma,active,No wait.,NaN,NaN
1,2,2,NaN,NaN,NaN,Apply by phone for an appointment.,Residents of San Mateo County age 55 or over,Provides training and job placement to eligibl...,"Age 55 or over, county resident and willing an...",NaN,...,NaN,"EMPLOYMENT/TRAINING SERVICES, Job Development,...",NaN,Second Career Employment Program,NaN,San Mateo County,active,Varies.,NaN,NaN
2,3,3,NaN,NaN,NaN,Phone for information (403-4300 Ext. 4322).,Older adults age 55 or over who can benefit fr...,Offers supportive counseling services to San M...,Resident of San Mateo County age 55 or over,NaN,...,NaN,"Geriatric Counseling, Older Adults, Gay, Lesbi...",NaN,Senior Peer Counseling,NaN,San Mateo County,active,Varies.,NaN,NaN

In [13]:
# Importing titanic dataset
titanic_df = pd.read_csv('I:/Data_Science_Master_ineuron/Dataset/titanic.csv')

In [14]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

**Q.4) How to get statistical description of a dataset ?**

**Ans)** In order to `Generate descriptive statistics.` use

><span class=mark>**`df.describe()`**</span>

In [15]:
titanic_df.describe()  # by default gives description of only numerical columns

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [16]:
# Getting statistics of only 'object' datatype columns 
titanic_df.describe(include = 'object')

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [17]:
# Getting statistics all columns in dataframe
titanic_df.describe(include= 'all')

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
count,891.000000,891.000000,891.000000,891,891,714.000000,891.000000,891.000000,891,891.000000,204,889
unique,NaN,NaN,NaN,891,2,NaN,NaN,NaN,681,NaN,147,3
top,NaN,NaN,NaN,"Braund, Mr. Owen Harris",male,NaN,NaN,NaN,347082,NaN,B96 B98,S
freq,NaN,NaN,NaN,1,577,NaN,NaN,NaN,7,NaN,4,644
mean,446.000000,0.383838,2.308642,NaN,NaN,29.699118,0.523008,0.381594,NaN,32.204208,NaN,NaN
std,257.353842,0.486592,0.836071,NaN,NaN,14.526497,1.102743,0.806057,NaN,49.693429,NaN,NaN
min,1.000000,0.000000,1.000000,NaN,NaN,0.420000,0.000000,0.000000,NaN,0.000000,NaN,NaN
25%,223.500000,0.000000,2.000000,NaN,NaN,20.125000,0.000000,0.000000,NaN,7.910400,NaN,NaN
50%,446.000000,0.000000,3.000000,NaN,NaN,28.000000,0.000000,0.000000,NaN,14.454200,NaN,NaN
75%,668.500000,1.000000,3.000000,NaN,NaN,38.000000,1.000000,0.000000,NaN,31.000000,NaN,NaN
max,891.000000,1.000000,3.000000,NaN,NaN,80.000000,8.000000,6.000000,NaN,512.329200,NaN,NaN

In [184]:
titanic_df.dtypes == 'object' # True:- If column is of object datatype otherwise false

Name            True
PassengerId    False
Survived       False
Pclass         False
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
new_col1       False
Fare_inr       False
Fare_class      True
dtype: bool

In [19]:
titanic_df.dtypes[titanic_df.dtypes == 'object'] # filter out only those columns 
# which satisfy the condition

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [20]:
type(titanic_df.dtypes[titanic_df.dtypes == 'object'])  # Returns series datatype

pandas.core.series.Series

In [21]:
titanic_df.dtypes[titanic_df.dtypes == 'object'].index # getting name of the columns from series

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [22]:
# Filtering:- Show only object datatype columns
titanic_df[titanic_df.dtypes[titanic_df.dtypes == 'object'].index]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [23]:
titanic_df[titanic_df.dtypes[titanic_df.dtypes == 'object'].index].describe()

                           Name   Sex  Ticket    Cabin Embarked
count                       891   891     891      204      889
unique                      891     2     681      147        3
top     Braund, Mr. Owen Harris  male  347082  B96 B98        S
freq                          1   577       7        4      644

In [24]:
# Filtering:- Showing columns whose datatype is integer
titanic_df[titanic_df.dtypes[titanic_df.dtypes=='int64'].index]

     PassengerId  Survived  Pclass  SibSp  Parch
0              1         0       3      1      0
1              2         1       1      1      0
2              3         1       3      0      0
3              4         1       1      1      0
4              5         0       3      0      0
..           ...       ...     ...    ...    ...
886          887         0       2      0      0
887          888         1       1      0      0
888          889         0       3      1      2
889          890         1       1      0      0
890          891         0       3      0      0

[891 rows x 5 columns]

In [185]:
# Filtering:- Showing columns whose datatype is 'float'
titanic_df[titanic_df.dtypes[titanic_df.dtypes=='float64'].index]

      Age     Fare  Fare_inr
0    22.0   7.2500   580.000
1    38.0  71.2833  5702.664
2    26.0   7.9250   634.000
3    35.0  53.1000  4248.000
4    35.0   8.0500   644.000
..    ...      ...       ...
886  27.0  13.0000  1040.000
887  19.0  30.0000  2400.000
888   NaN  23.4500  1876.000
889  26.0  30.0000  2400.000
890  32.0   7.7500   620.000

[891 rows x 3 columns]

**Q.5) Create a new column which is the addition of `PassengerId` and `Pclass` column of titanic dataset ?**

In [186]:
titanic_df['new_col1'] = titanic_df['PassengerId'] + titanic_df['Pclass']

In [187]:
titanic_df[['PassengerId','Pclass','new_col1']]

     PassengerId  Pclass  new_col1
0              1       3         4
1              2       1         3
2              3       3         6
3              4       1         5
4              5       3         8
..           ...     ...       ...
886          887       2       889
887          888       1       889
888          889       3       892
889          890       1       891
890          891       3       894

[891 rows x 3 columns]

**Q.6) How to get the categorical data on any column of data frame ?**

**Ans)** In order to get the various category of particular column use...

><span class = 'mark'>**`Syntax:--> pd.Categorical(df['column'])`**</span>

In [28]:
pd.Categorical(titanic_df['Pclass']) # in this columns we have 3 categories of values

[3, 1, 3, 1, 3, ..., 2, 1, 3, 1, 3]
Length: 891
Categories (3, int64): [1, 2, 3]

In [29]:
# Getting all the unique value of 'Cabin' column
titanic_df['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

**Q.7) Filter out all records where age is greater than 18 (adult)**

In [30]:
titanic_df[titanic_df['Age']>18] # Records where age is greater than 18

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,4
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,3
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,6
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,5
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...
885,886,0,3,"Rice, Mrs. William (Margaret Norton)",female,39.0,0,5,382652,29.1250,NaN,Q,889
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,889
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,889
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,891
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,894

**Q.8) Filter out all person who paid Fare less than average fare**

In [31]:
avg_fare = np.mean(titanic_df['Fare']) # 32.2042
titanic_df[titanic_df['Fare']< avg_fare] # There are 680 people

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,4
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,6
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,8
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,9
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S,11
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,889
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,889
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,892
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,891
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,894

**Q.9) Filter out the person names & their Pclass who paid 0 fare**

In [32]:
titanic_df[titanic_df['Fare']==0][['Name','Pclass']]

                                 Name  Pclass
179               Leonard, Mr. Lionel       3
263             Harrison, Mr. William       1
271      Tornquist, Mr. William Henry       3
277       Parkes, Mr. Francis "Frank"       2
302   Johnson, Mr. William Cahoone Jr       3
413    Cunningham, Mr. Alfred Fleming       2
466             Campbell, Mr. William       2
481  Frost, Mr. Anthony Wood "Archie"       2
597               Johnson, Mr. Alfred       3
633     Parr, Mr. William Henry Marsh       1
674        Watson, Mr. Ennis Hastings       2
732              Knight, Mr. Robert J       2
806            Andrews, Mr. Thomas Jr       1
815                  Fry, Mr. Richard       1
822   Reuchlin, Jonkheer. John George       1

**Q.10) Filter out  passenger  who are male**

In [33]:
titanic_df[titanic_df['Sex'] == 'male'][['Name']]

                               Name
0           Braund, Mr. Owen Harris
4          Allen, Mr. William Henry
5                  Moran, Mr. James
6           McCarthy, Mr. Timothy J
7    Palsson, Master. Gosta Leonard
..                              ...
883   Banfield, Mr. Frederick James
884          Sutehall, Mr. Henry Jr
886           Montvila, Rev. Juozas
889           Behr, Mr. Karl Howell
890             Dooley, Mr. Patrick

[577 rows x 1 columns]

**Q.11) Filter out names of survived people**

In [34]:
titanic_df[titanic_df['Survived'] == 1][['Name']]

                                                  Name
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                  Nasser, Mrs. Nicholas (Adele Achem)
..                                                 ...
875                   Najib, Miss. Adele Kiamie "Jane"
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)
880       Shelley, Mrs. William (Imanita Parrish Hall)
887                       Graham, Miss. Margaret Edith
889                              Behr, Mr. Karl Howell

[342 rows x 1 columns]

**Q.12) Filter out the names of female whose ticket price were more than average fare**

In [35]:
titanic_df[(titanic_df['Sex'] == 'female') & (titanic_df['Fare'] > avg_fare)][['Name']]

                                                  Name
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
31      Spencer, Mrs. William Augustus (Marie Eugenie)
43            Laroche, Miss. Simonne Marie Anne Andree
52            Harper, Mrs. Henry Sleeper (Myna Haxtun)
..                                                 ...
853                          Lines, Miss. Mary Conover
856         Wick, Mrs. George Dennick (Mary Hitchcock)
863                  Sage, Miss. Dorothy Edith "Dolly"
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)

[104 rows x 1 columns]

**Q.13) Filter out the person names who have paid maximum fare**

In [36]:
max_fare = max(titanic_df['Fare'])
titanic_df[titanic_df['Fare'] == max_fare][['Name']]

                                   Name
258                    Ward, Miss. Anna
679  Cardeza, Mr. Thomas Drake Martinez
737              Lesurer, Mr. Gustave J

**Q.14) Extract all the records range(0,100) present at even position**

In [188]:
titanic_df[0:100:2].head()

,Name,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col1,Fare_inr,Fare_class
0,"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,4,580.000,cheap
2,"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,6,634.000,cheap
4,"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,8,644.000,cheap
6,"McCarthy, Mr. Timothy J",7,0,1,male,54.0,0,0,17463,51.8625,E46,S,8,4149.000,high
8,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",9,1,3,female,27.0,0,2,347742,11.1333,NaN,S,12,890.664,mid

**Q.15) What is the difference between `df.iloc` and `df.loc()` ?**

**Ans)**  
><span class = 'mark'>**`df.iloc`**</span> always try to select data with ***inbuilt indexes***

><span class = 'mark'>**`df.loc`**</span> always try to select data with ***named indexes***

In [38]:
# Demonstration of df.iloc()
titanic_df.iloc[0:2,0:3] # Selecting first two rows and 1st three columns

   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1

In [39]:
# Demonstration of df.loc()
titanic_df.loc[:2,['PassengerId','Survived','Pclass']] # there are total 3 records 
# Because df.loc() use name instead of index location for extracting records

   PassengerId  Survived  Pclass
0            1         0       3
1            2         1       1
2            3         1       3

**Q.16) Extract records name ranging form (2-10)**

In [40]:
print('type:',type(titanic_df['Name']))
titanic_df['Name'][2:11] # Extracting records from 2 to 10 recrods

type: <class 'pandas.core.series.Series'>

2                                Heikkinen, Miss. Laina
3          Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                              Allen, Mr. William Henry
5                                      Moran, Mr. James
6                               McCarthy, Mr. Timothy J
7                        Palsson, Master. Gosta Leonard
8     Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)
9                   Nasser, Mrs. Nicholas (Adele Achem)
10                      Sandstrom, Miss. Marguerite Rut
Name: Name, dtype: object

**Q.17) Convert a list into a series and vice-versa?**
>**l = ['a','b','c','d','e','f']**

>**Ans)** In order to convert a list into series use...

><span class = 'mark'>**`Syntax:- pd.Series(vector)`**</span>

In [41]:
l = ['a','b','c','d','e','f']  # list

# converting a list to a series
print(type(l))
s = pd.Series(l)
print(type(s))
s

<class 'list'>
<class 'pandas.core.series.Series'>

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

**Q.18) Change the default indexes of series**

**Ans)** In order to replace the default indexes of the series use...

><span class = 'mark'>**`Syntax:- pd.Series(vector,index = [`new_indexes])`**</span>

In [42]:
s = pd.Series(l)
s

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [43]:
# replacing with 'alpha' digit
s1 = pd.Series(l,index = ['Zero','One','Two','Three','Four','Five'])
s1

Zero     a
One      b
Two      c
Three    d
Four     e
Five     f
dtype: object

**Q.19) How to concatenate a series to another series ?**

**Ans)** In order to concatenate series together use...

><span class = 'mark'>**`Syntax:- pd.concat([s1,s2,...])`**</span>

In [44]:
s2 =  pd.concat([s,s1])
s2

0        a
1        b
2        c
3        d
4        e
5        f
Zero     a
One      b
Two      c
Three    d
Four     e
Five     f
dtype: object

**Q.20) How to drop rows and columns from in data frame?**

**Ans)** In order to ***`drop rows`*** from data frame use...

><span class = 'mark'>**`df.drop(labels = [row_indexes],axis=0)`**</span>

In order to ***`drop columns`*** from data frame use...

><span class = 'mark'>**`df.drop(labels = [column_names],axis=1)`**</span>

In [45]:
# Demonstration:- Droping Columns 
print('oringinal Columns:\n',titanic_df.columns)

print('---------------------------------')

#Droping 'PassengerId' and 'Survived' columns (axis =1)
print('After Droping columns:\n',titanic_df.drop(labels=['PassengerId','Survived'],axis = 1).columns)

oringinal Columns:
 Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'new_col1'],
      dtype='object')
---------------------------------
After Droping columns:
 Index(['Pclass', 'Name', 'Sex', 'Age', 'SibSp', 'Parch', 'Ticket', 'Fare',
       'Cabin', 'Embarked', 'new_col1'],
      dtype='object')

In [46]:
# Demonstration :- Droping Rows
# Droping first two records from the data frame
titanic_df.drop(labels = list(range(2))) # row [0,1] is droped

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,6
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,5
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,8
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q,9
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,8
...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S,889
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S,889
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S,892
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C,891
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q,894

**Q.21) How to make column data as index(row) of a data frame ?**

**Ans)** In order to set column as index use...

><span class = 'mark'>**`df.set_index(['Column_name'])`**</span>

In [47]:
# Setting `Name` column as index  (inplace = False)
titanic_df.set_index(['Name'],inplace = True)

In [48]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col1
Name,,,,,,,,,,,,
"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,4
"Cumings, Mrs. John Bradley (Florence Briggs Thayer)",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,3
"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,6

**Q.22) How to set index of a data-frame to its default index values ?**

**Ans)** In order to set index value of data-frame to its default index values use...

><span class = 'mark'>**`Syntax:- df.reset_index()`**</span>

In [49]:
# Reseting the index values to its default values
titanic_df.reset_index(inplace = True)

In [50]:
titanic_df.head(3)

,Name,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col1
0,"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,4
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,3
2,"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,6

**Q.23) How to convert a dictionary to data-frame?** 

**Ans)** In order to convert a dictionary to a data-frame use...

><span class='mark'>**`Syntax:- pd.DataFrame('dictonary')`**</span>

In [51]:
d1 = {'Name':('Apple','Banana','Grapes'),
      'Price(Rs)':[80,45,60],
      'Kg':[1,1,1]}

fruit_df = pd.DataFrame(d1)
fruit_df

     Name  Price(Rs)  Kg
0   Apple         80   1
1  Banana         45   1
2  Grapes         60   1

In [52]:
taxonomy_df = pd.read_csv('I:/Data_Science_Master_ineuron/Dataset/taxonomy.csv')

In [53]:
taxonomy_df.head()

  taxonomy_id                     name parent_id     parent_name
0         101                Emergency       NaN             NaN
1      101-01        Disaster Response       101       Emergency
2      101-02           Emergency Cash       101       Emergency
3   101-02-01        Help Pay for Food    101-02  Emergency Cash
4   101-02-02  Help Pay for Healthcare    101-02  Emergency Cash

**Q.24) How to find 'NaN' value in data-frame ?**

**Ans)** In order to find 'NaN' values in a data-frame use...

><span class = 'mark'>**`Syntax:- df.isnull()`**</span>

In order to find which columns contain 'NaN' values use...

><span class = 'mark'>**`Syntax:- df.isnull().any()`**</span>

In order to find Numbers of NaN records in each columns use...

><span class = 'mark'>**`Syntax:- df.isnull().sum()`**</span>

In [54]:
print('Columns datatypes:\n',taxonomy_df.dtypes)
print('=====================================')
print('Columns containing "NaN" values are:-\n',taxonomy_df.isnull().any())
print('='*20)
print('Total no. of columns containing "NaN" values are:',sum(taxonomy_df.isnull().any()))
print('='*20)
print('Total no.s of "NaN" values in each columns are:-\n',taxonomy_df.isnull().sum())

Columns datatypes:
 taxonomy_id    object
name           object
parent_id      object
parent_name    object
dtype: object
=====================================
Columns containing "NaN" values are:-
 taxonomy_id    False
name           False
parent_id       True
parent_name     True
dtype: bool
====================
Total no. of columns containing "NaN" values are: 2
====================
Total no.s of "NaN" values in each columns are:-
 taxonomy_id     0
name            0
parent_id      11
parent_name    11
dtype: int64

**Q.25) How to drop a 'NaN' value from a data-frame ?**

**Ans** In order drop **`records`** containing **`NaN`** values use...
><span class = 'mark'>**`Syntax:- df.dropna(axis  = 0)`**</span>

In order drop **`columns`** containing **`NaN`** values use...
><span class = 'mark'>**`Syntax:- df.dropna(axis = 1)`**</span>

In [55]:
# Demonstration:- Droping records containing 'NaN' values
print('Original Dataframe:')
print(taxonomy_df.head())
print('='*20)

print('Droping records having "NaN" values:')
print(taxonomy_df.dropna()) # default inplace = False
print('='*20)

print('Droping columns having "NaN" values:')
print(taxonomy_df.dropna(axis =1)) # inplace = False

Original Dataframe:
  taxonomy_id                     name parent_id     parent_name
0         101                Emergency       NaN             NaN
1      101-01        Disaster Response       101       Emergency
2      101-02           Emergency Cash       101       Emergency
3   101-02-01        Help Pay for Food    101-02  Emergency Cash
4   101-02-02  Help Pay for Healthcare    101-02  Emergency Cash
====================
Droping records having "NaN" values:
    taxonomy_id                          name parent_id           parent_name
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
3     101-02-01             Help Pay for Food    101-02        Emergency Cash
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
5     101-02-03          Help Pay for Housing    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[279 rows x 4 columns]
====================
Droping columns having "NaN" values:
    taxonomy_id                          name
0           101                     Emergency
1        101-01             Disaster Response
2        101-02                Emergency Cash
3     101-02-01             Help Pay for Food
4     101-02-02       Help Pay for Healthcare
..          ...                           ...
285   111-01-07              Workplace Rights
286      111-02                     Mediation
287      111-03                        Notary
288      111-04                Representation
289      111-05  Translation & Interpretation

[290 rows x 2 columns]

**Q.26) How to fill `NaN` values with some constant ?**

**Ans)** In order to fill `NaN` values with some constant use...
><span class = 'mark'>**`Syntax:- df.fillna(value = 'value')`**</span>

In [56]:
# Demonstration:- filling 'NaN' values of columns with next valid values
taxonomy_df.fillna(method = 'backfill') # use next valid observation to fill NaN

    taxonomy_id                          name parent_id           parent_name
0           101                     Emergency       101             Emergency
1        101-01             Disaster Response       101             Emergency
2        101-02                Emergency Cash       101             Emergency
3     101-02-01             Help Pay for Food    101-02        Emergency Cash
4     101-02-02       Help Pay for Healthcare    101-02        Emergency Cash
..          ...                           ...       ...                   ...
285   111-01-07              Workplace Rights    111-01  Advocacy & Legal Aid
286      111-02                     Mediation       111                 Legal
287      111-03                        Notary       111                 Legal
288      111-04                Representation       111                 Legal
289      111-05  Translation & Interpretation       111                 Legal

[290 rows x 4 columns]

 **Q.27) How to group(cluster) similar data together?**
 
 **Ans)** In order to group similar object together use...

><span class = 'mark'>**`Syntax:- df.groupby('column_name')`**

In [57]:
# Demonstration:- Average fair paid by the person who has survived 
# and who have survived
titanic_df.groupby('Survived').mean()

<ipython-input-57-77bd35c4f3a4>:3: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  titanic_df.groupby('Survived').mean()

,PassengerId,Pclass,Age,SibSp,Parch,Fare,new_col1
Survived,,,,,,,
0,447.016393,2.531876,30.626179,0.553734,0.329690,22.117887,449.548270
1,444.368421,1.950292,28.343690,0.473684,0.464912,48.395408,446.318713

**Q.28) What is the total revenue from male and female person?**

In [58]:
# Demonstration:- Revenue by each sex
titanic_df.groupby('Sex').sum()["Fare"]

<ipython-input-58-4264c93ea5fe>:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  titanic_df.groupby('Sex').sum()["Fare"]

Sex
female    13966.6628
male      14727.2865
Name: Fare, dtype: float64

**Q.29) What is the average age of male and female passenger?**

In [59]:
# Average age of male and female passenger
titanic_df.groupby('Sex').mean()['Age']

<ipython-input-59-24afe20baec0>:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  titanic_df.groupby('Sex').mean()['Age']

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

**Q.30) What was the Average Fare paid by passenger of each class?**

In [60]:
df3 = titanic_df.groupby('Pclass').mean()

<ipython-input-60-646f4c977816>:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df3 = titanic_df.groupby('Pclass').mean()

In [61]:
df3

,PassengerId,Survived,Age,SibSp,Parch,Fare,new_col1
Pclass,,,,,,,
1,461.597222,0.629630,38.233441,0.416667,0.356481,84.154687,462.597222
2,445.956522,0.472826,29.877630,0.402174,0.380435,20.662183,447.956522
3,439.154786,0.242363,25.140620,0.615071,0.393075,13.675550,442.154786

**Q.31) How to transpose a data-frame?**

In [62]:
df3.T

Pclass                1           2           3
PassengerId  461.597222  445.956522  439.154786
Survived       0.629630    0.472826    0.242363
Age           38.233441   29.877630   25.140620
SibSp          0.416667    0.402174    0.615071
Parch          0.356481    0.380435    0.393075
Fare          84.154687   20.662183   13.675550
new_col1     462.597222  447.956522  442.154786

In [63]:
df3.transpose()

Pclass                1           2           3
PassengerId  461.597222  445.956522  439.154786
Survived       0.629630    0.472826    0.242363
Age           38.233441   29.877630   25.140620
SibSp          0.416667    0.402174    0.615071
Parch          0.356481    0.380435    0.393075
Fare          84.154687   20.662183   13.675550
new_col1     462.597222  447.956522  442.154786

**Q.32) How to concatenate data-frames?**

**Ans)** In order to perform **`Vertical concatenation`** use...

><span class = 'mark'>**`Syntax:- pd.concat([df1,df2],axis=0)`**</span>

In order to perform **`Horizontal concatenation`** use...

><span class = 'mark'>**`Syntax:- pd.concat([df1,df2],axis=1)`**</span>

In [64]:
df1 = titanic_df[['Name', 'PassengerId', 'Survived']][0:5]
df2 = titanic_df[['Name', 'PassengerId', 'Survived']][5:10]

In [65]:
# Demonstration:- Vertical Concatenation
pd.concat([df1,df2])

                                                Name  PassengerId  Survived
0                            Braund, Mr. Owen Harris            1         0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...            2         1
2                             Heikkinen, Miss. Laina            3         1
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)            4         1
4                           Allen, Mr. William Henry            5         0
5                                   Moran, Mr. James            6         0
6                            McCarthy, Mr. Timothy J            7         0
7                     Palsson, Master. Gosta Leonard            8         0
8  Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)            9         1
9                Nasser, Mrs. Nicholas (Adele Achem)           10         1

In [66]:
# Demonstration: Horizontal concatenation
pd.concat([df1,df2],axis = 1)

,Name,PassengerId,Survived,Name,PassengerId,Survived
0,"Braund, Mr. Owen Harris",1.0,0.0,NaN,NaN,NaN
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2.0,1.0,NaN,NaN,NaN
2,"Heikkinen, Miss. Laina",3.0,1.0,NaN,NaN,NaN
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4.0,1.0,NaN,NaN,NaN
4,"Allen, Mr. William Henry",5.0,0.0,NaN,NaN,NaN
5,NaN,NaN,NaN,"Moran, Mr. James",6.0,0.0
6,NaN,NaN,NaN,"McCarthy, Mr. Timothy J",7.0,0.0
7,NaN,NaN,NaN,"Palsson, Master. Gosta Leonard",8.0,0.0
8,NaN,NaN,NaN,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",9.0,1.0
9,NaN,NaN,NaN,"Nasser, Mrs. Nicholas (Adele Achem)",10.0,1.0

In [67]:
fruit_df1 = pd.DataFrame({'Name':['Apple','Banana','Watermelon'],
             'Quality':('Good','Average','Poor')})
fruit_df1

         Name  Quality
0       Apple     Good
1      Banana  Average
2  Watermelon     Poor

In [68]:
fruit_df

     Name  Price(Rs)  Kg
0   Apple         80   1
1  Banana         45   1
2  Grapes         60   1

**Q.33) How to `merge` data-frames together?**

**Ans)** In order to **merge** data-frames together use...

>**1. Inner Merge:-** Merge based on ***`use intersection of keys(column) from both data-frames; preserve order of the left keys`***

><span class = 'mark'>**`pd.merge(left = df1,right = df2,how = 'innner')`**</span>

In [69]:
# Demonstration:- Inner merger
pd.merge(left = fruit_df,right=fruit_df1)

     Name  Price(Rs)  Kg  Quality
0   Apple         80   1     Good
1  Banana         45   1  Average

**Left Merge:-** use ***`only keys(columns) from left data-frame`***; preserve key order.

><span class = 'mark'>**`Syntax:- pd.merge(left= df1,right=df2,how ='left')`**</span>

In [70]:
# Demonstration:- Left merge
pd.merge(fruit_df,fruit_df1,how = 'left')

     Name  Price(Rs)  Kg  Quality
0   Apple         80   1     Good
1  Banana         45   1  Average
2  Grapes         60   1      NaN

**Right Merge:-** use ***`only keys(column) from right frame`***;preserve key order.

><span class = 'mark'>**`Syntax:- pd.merge(left= df1,right= df2,how = 'right')`**</span>

In [71]:
# Demonstration:- Right Merge
pd.merge(fruit_df,fruit_df1,how = 'right')

         Name  Price(Rs)   Kg  Quality
0       Apple       80.0  1.0     Good
1      Banana       45.0  1.0  Average
2  Watermelon        NaN  NaN     Poor

**Outer Merge:-** use ***`union of keys(columns) from both data-frames`***; sort keys lexicographically.

><span class = 'mark'>**`Syntax:- pd.merge(left= df1,right= df2,how = 'outer')`**</span>

In [72]:
# Demonstration:- Right Merge
pd.merge(fruit_df,fruit_df1, how = 'outer')

         Name  Price(Rs)   Kg  Quality
0       Apple       80.0  1.0     Good
1      Banana       45.0  1.0  Average
2      Grapes       60.0  1.0      NaN
3  Watermelon        NaN  NaN     Poor

**Cross Merge:-** creates the ***`cartesian product from both frames`***, preserves the order of the left keys

><span class = 'mark'>**`Syntax:- pd.merge(left= df1,right= df2,how = 'cross')`**</span>

In [73]:
# Demonstration:- Cross merge
pd.merge(fruit_df,fruit_df1,how = 'cross')

   Name_x  Price(Rs)  Kg      Name_y  Quality
0   Apple         80   1       Apple     Good
1   Apple         80   1      Banana  Average
2   Apple         80   1  Watermelon     Poor
3  Banana         45   1       Apple     Good
4  Banana         45   1      Banana  Average
5  Banana         45   1  Watermelon     Poor
6  Grapes         60   1       Apple     Good
7  Grapes         60   1      Banana  Average
8  Grapes         60   1  Watermelon     Poor

# Join Operation

**Q.34) How to join the data-frames together?**

**Ans)** `Join` operation ***by default works on `indices(rows)` of data frames***

In [74]:
data1 = pd.DataFrame({'key1':(1,2,3,4),
                      'key2':(5,6,7,8)},
                    index = ['a','b','c','d'])

data2 = pd.DataFrame({'key3':(9,10,11,12),
                      'key4':(13,14,15,16)},
                    index = ['a','b','e','f'])

In [75]:
data1

   key1  key2
a     1     5
b     2     6
c     3     7
d     4     8

In [76]:
data2

   key3  key4
a     9    13
b    10    14
e    11    15
f    12    16

**Inner Join:-** form intersection of calling frame's index (df1) with **`other`**'s index(df2), preserving the order
      of the calling's one(df1).
      
><span class = 'mark'>**`Syntax:- df1.join(df2,how = 'inner')`**</span>

In [77]:
# Demonstration:- Inner join
data1.join(data2,how = 'inner')

   key1  key2  key3  key4
a     1     5     9    13
b     2     6    10    14

**Left Join:-**  use ***`calling frame's index (df1)`***

><span class = 'mark'>**`Syntax:- df1.join(df2,how = 'left')`**</span>

In [78]:
data1.join(data2,how ='left')

   key1  key2  key3  key4
a     1     5   9.0  13.0
b     2     6  10.0  14.0
c     3     7   NaN   NaN
d     4     8   NaN   NaN

**Right Join:-**  ***use `other`'s index(df2).***

><span class = 'mark'>**`Syntax:- df1.join(df2,how = 'right')`**</span>

In [79]:
data1.join(data2,how = 'right')

   key1  key2  key3  key4
a   1.0   5.0     9    13
b   2.0   6.0    10    14
e   NaN   NaN    11    15
f   NaN   NaN    12    16

**Outer Join:-** ***form union of calling frame's index `(df1)` with `other`'s index `(df2)`, and sort it.
      lexicographically.***
      
><span class = 'mark'>**`Syntax:- df1.join(df2,how = 'outer')`**</span>

In [80]:
data1.join(data2,how = 'outer')

   key1  key2  key3  key4
a   1.0   5.0   9.0  13.0
b   2.0   6.0  10.0  14.0
c   3.0   7.0   NaN   NaN
d   4.0   8.0   NaN   NaN
e   NaN   NaN  11.0  15.0
f   NaN   NaN  12.0  16.0

**Cross Join:-** ***creates the `cartesian` product from both frames, preserves the order
      of the left keys.***
      
><span class = 'mark'>**`Syntax:- df1.join(df2,how = 'cross')`**</span>

In [81]:
data1.join(data2,how = 'cross')

    key1  key2  key3  key4
0      1     5     9    13
1      1     5    10    14
2      1     5    11    15
3      1     5    12    16
4      2     6     9    13
5      2     6    10    14
6      2     6    11    15
7      2     6    12    16
8      3     7     9    13
9      3     7    10    14
10     3     7    11    15
11     3     7    12    16
12     4     8     9    13
13     4     8    10    14
14     4     8    11    15
15     4     8    12    16

**Q.35)Create a new column which contain fare of each person in INR**

**Ans)** In order to perform ***`map operation`*** on any column use...

><span class = 'mark'>**`Syntax:- df['column_name'].apply('func')`**</span>

In [82]:
titanic_df['Fare_inr'] = titanic_df['Fare'].apply(lambda x: x *80)

In [83]:
titanic_df.head(3)

,Name,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col1,Fare_inr
0,"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,4,580.000
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,3,5702.664
2,"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,6,634.000

In [84]:
titanic_df.head()

,Name,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col1,Fare_inr
0,"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,4,580.000
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,3,5702.664
2,"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,6,634.000
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",4,1,1,female,35.0,1,0,113803,53.1000,C123,S,5,4248.000
4,"Allen, Mr. William Henry",5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,8,644.000

**Q.36) Create a new to Categories the Fare in cheap,mid and high class**

In [85]:
def fare_category(x):
    if x<10:
        return 'cheap'
    elif(x>=10 and x <20):
        return 'mid'
    else:
        return 'high'

In [86]:
titanic_df['Fare_class'] = titanic_df['Fare'].apply(fare_category)

In [87]:
titanic_df.head(3)

,Name,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_col1,Fare_inr,Fare_class
0,"Braund, Mr. Owen Harris",1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,4,580.000,cheap
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,3,5702.664,high
2,"Heikkinen, Miss. Laina",3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,6,634.000,cheap

 **Q.35) How to reorder the records in the data-frame?**
 
 **Ans)** In order to change the order of the records in the data frame use...
 
><span class = 'mark'>**`Syntax:- df.reindex(['new_index_positions'])`**</span>

In [88]:
# Demonstration of reordering records
data = {"k1":(1,2,3),
        "k2":(4,5,6)}
df0 = pd.DataFrame(data,index= ['a','b','c'])
df0

   k1  k2
a   1   4
b   2   5
c   3   6

In [89]:
df0.reindex(['c','b','a']) # inplace = False

   k1  k2
c   3   6
b   2   5
a   1   4

In [90]:
df0

   k1  k2
a   1   4
b   2   5
c   3   6

**Q.36) How to iterate records in `row-wise` manner ?**

**Ans)** In order to iterate through records in `row-wise` manner use...

><span class = 'mark'>**`Syntax:- df.iterrows()`**</span>

In [91]:
# Demonstration:- Iterating records in row-wise manner
for i in df0.iterrows():
    print(i) # return: (row_index,col_name col_value,...)

('a', k1    1
k2    4
Name: a, dtype: int64)
('b', k1    2
k2    5
Name: b, dtype: int64)
('c', k1    3
k2    6
Name: c, dtype: int64)

**Q.37) Get the sum of each column of a data-frame ?**

**Ans)** In order to get the sum of each column use...

><span class='mark'>**`Syntax:- df.apply('sum_function')`**</span>

In [92]:
df0

   k1  k2
a   1   4
b   2   5
c   3   6

In [93]:
df0.apply(sum)

k1     6
k2    15
dtype: int64

**Q.38) Create a new data frame which square of `df0` data-frame?**

**Ans)** Use...

><span class='mark'>**`Syntax:-df0.apply(lambda x:x*x)`**</span>

In [94]:
df0

   k1  k2
a   1   4
b   2   5
c   3   6

In [95]:
df4 = df0.apply(lambda x: x*x)
df4

   k1  k2
a   1  16
b   4  25
c   9  36

In [96]:
# Adding new column
df0['k3'] = ['Sumit','Rahul','Alpha']

**Q.39) Sort the data-frame `df0` based on column-3**

**Ans)** In order to perform sorting use...

><span class ='mark'>**`Syntax:- df.sort_values('column_name')`**</span>

In [97]:
print('Original Dataframe')
df0

Original Dataframe

   k1  k2     k3
a   1   4  Sumit
b   2   5  Rahul
c   3   6  Alpha

In [98]:
# Demonstration:- Sorting a data-fram based on specific column
df0.sort_values('k3')

   k1  k2     k3
c   3   6  Alpha
b   2   5  Rahul
a   1   4  Sumit

**Q.40) Sort the data-frame `df0` in descending order based on indexes**

**Ans)** In order to sort the data-frame based on indexes use...

><span class = 'mark'>**`Syntax:- df.sort_index(ascending = False)`**</span>

In [99]:
df0

   k1  k2     k3
a   1   4  Sumit
b   2   5  Rahul
c   3   6  Alpha

In [100]:
df0.sort_index(ascending = False)

   k1  k2     k3
c   3   6  Alpha
b   2   5  Rahul
a   1   4  Sumit

**Q.40) How to select a columns with `specific data types` in a data-frame?**

**Ans)** In order to select columns with specific data types use...

><span class = 'mark'>**`Syntax:- df.select_dtypes(include = 'data_type)`**</span>

In [112]:
# Selecting numerical column of df0 data-frame
df0.select_dtypes(include = 'number')

   k1  k2
a   1   4
b   2   5
c   3   6

In [115]:
# Selecting only 'string' column
df0.select_dtypes(include = 'object')

      k3
a  Sumit
b  Rahul
c  Alpha

**Q.41) Get `mean,median,mode,standard divation and variance of numerical columns of df0 data-frame`**

In [104]:
df0

   k1  k2     k3
a   1   4  Sumit
b   2   5  Rahul
c   3   6  Alpha

In [116]:
# Mean of df0
df0.select_dtypes(include = np.number).mean()

k1    2.0
k2    5.0
dtype: float64

In [117]:
# Median of df0
df0.select_dtypes(include = 'number').median()

k1    2.0
k2    5.0
dtype: float64

In [118]:
# Mode of df0
df0.select_dtypes(include = 'number').mode()

   k1  k2
0   1   4
1   2   5
2   3   6

In [120]:
# Standard Deviation of df0
df0.select_dtypes(include = 'number').std()

k1    1.0
k2    1.0
dtype: float64

In [121]:
# Variance of df0
df0.select_dtypes(include = 'number').var()

k1    1.0
k2    1.0
dtype: float64

**Q.42) How to perform `rolling-window` operation on data-frame?**

**Ans)** In order to perform `rolling-window` operation on data-frame use...

><span class = 'mark'>**`Syntax:- df.rolling(window = 'window_size')`**</span>

In [124]:
# Demonstration of rolling window on df0
df0['k1']

a    1
b    2
c    3
Name: k1, dtype: int64

In [125]:
# Mean
df0.rolling(window = 1).mean()

<ipython-input-125-b87f7da5493d>:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['k3'], dtype='object')
  df0.rolling(window = 1).mean()

    k1   k2
a  1.0  4.0
b  2.0  5.0
c  3.0  6.0

In [126]:
df0.rolling(window = 2).mean()

<ipython-input-126-3bb651131dae>:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['k3'], dtype='object')
  df0.rolling(window = 2).mean()

    k1   k2
a  NaN  NaN
b  1.5  4.5
c  2.5  5.5

In [127]:
df0.rolling(window = 3).mean()

<ipython-input-127-a8a2fd538e92>:1: FutureWarning: Dropping of nuisance columns in rolling operations is deprecated; in a future version this will raise TypeError. Select only valid columns before calling the operation. Dropped columns were Index(['k3'], dtype='object')
  df0.rolling(window = 3).mean()

    k1   k2
a  NaN  NaN
b  NaN  NaN
c  2.0  5.0

**Q.43) How to perform `cumsum` operation on data-frame?**

**Ans)** In order to perform cumsum operation use...

><span class='mark'>**`Syntax:- df.cumsum()`**</span>

In [131]:
df5 = pd.DataFrame(range(1,11),columns=['k1'])

In [132]:
df5

   k1
0   1
1   2
2   3
3   4
4   5
5   6
6   7
7   8
8   9
9  10

In [133]:
# Demonstration:- cumsum operation 
df5.cumsum() # Return cumulative sum over a DataFrame or Series axis.

   k1
0   1
1   3
2   6
3  10
4  15
5  21
6  28
7  36
8  45
9  55

**Q.44) Create a data-frame containing `date` in range(start_date,end_range)**

**Ans)** In order to create `date` range data use...

><span class = 'mark'>**`Syntax:- pd.date_range(start,end)`**</span>

In [134]:
# Demonstration:- date data
date_data = pd.date_range(start = '2023-01-01',end='2023-05-7') #yy-mm-day

In [135]:
date_df = pd.DataFrame({'date':date_data})

In [137]:
print(date_df.dtypes)
date_df

date    datetime64[ns]
dtype: object

          date
0   2023-01-01
1   2023-01-02
2   2023-01-03
3   2023-01-04
4   2023-01-05
..         ...
122 2023-05-03
123 2023-05-04
124 2023-05-05
125 2023-05-06
126 2023-05-07

[127 rows x 1 columns]

**Q.45) How to convert `string` based date to `datetime64` date?**

**Ans)** In order to convert `string` based date into `datetime64` format use...

><span class = 'mark'>**`Syntax:- pd.to_datetime(df)`**</span>

In [138]:
df6 = pd.DataFrame({'date':['2023-05-07','2023-05-06','2023-05-05']})

In [141]:
print(df6['date'].dtypes)
df6

object

         date
0  2023-05-07
1  2023-05-06
2  2023-05-05

In [142]:
#Demonstration:- Converting string based date to 'datetime64' format
df6['updated_date'] = pd.to_datetime(df6['date'])

In [143]:
print(df6['updated_date'].dtypes)
df6

datetime64[ns]

         date updated_date
0  2023-05-07   2023-05-07
1  2023-05-06   2023-05-06
2  2023-05-05   2023-05-05

**Q.46) Create a new columns which store year,month and day separately of df6 data-frame**

**Ans)** 
>In order to extract `only year` from **datetime64** data use...

><span class = 'mark'>**`Syntax:- df.dt.year`**
    
>In order to extract `only month` from **datetime64** data use...

><span class = 'mark'>**`Syntax:- df.dt.month`**</span>
    
>In order to extract `only day` from **datetime64** data use...

><span class = 'mark'>**`Syntax:- df.dt.day`**</span>

In [147]:
# Demonstration:- Extracting year,month,day from 'datetime64' data

df6['year'] = df6['updated_date'].dt.year # year
df6['month'] = df6['updated_date'].dt.month # month
df6['day'] = df6['updated_date'].dt.day # day

         date updated_date  year  month  day
0  2023-05-07   2023-05-07  2023      5    7
1  2023-05-06   2023-05-06  2023      5    6
2  2023-05-05   2023-05-05  2023      5    5

**Q.47) What is `timedelta` function in pandas?**

**Ans)** 
>***Timedelta :=***  Represents a duration, the **`difference between two dates or times.`**

><span class = 'mark'>**`Syntax:- pd.Timedelta()`**</span>

In [153]:
# Demonstration:- Timedelta
time = pd.Timedelta(days = 1,hours = 4,minutes = 36)
time

Timedelta('1 days 04:36:00')

In [154]:
time_1 = pd.to_datetime('2023-05-05')
time_1

Timestamp('2023-05-05 00:00:00')

In [157]:
# Adding two times
time_add = time+time_1
print('Add Time:',time_add)

Add Time: 2023-05-06 04:36:00

**Q.50) Find various categories in a data and total number of data of each category**

**Ans)** 
>In order to get all **`categories present in data`** use...

><span class ='mark'>**`Syntax:- pd.Categorical(data)`**</span>

>In order to get **`total number of data of each category`** use...

><span class = 'mark'>**`Syntax:- df.value_counts()`**</span>

In [167]:
data = pd.DataFrame(data = [1,2,3,1,1,2],columns=['c1'])
data

   c1
0   1
1   2
2   3
3   1
4   1
5   2

In [169]:
#Demonstration:- Categories in a data
pd.Categorical(data['c1'])

[1, 2, 3, 1, 1, 2]
Categories (3, int64): [1, 2, 3]

In [171]:
#Demonstration:- Total number of data belonging to each category
data.value_counts()

c1
1     3
2     2
3     1
dtype: int64

In [172]:
data = {'name': ['John', 'Jane', 'Bob'], 'age': [25, 30, 35]}

df = pd.DataFrame(data)

 

for index, row in df.iterrows():

    print(row['name'], row['age'])

John 25
Jane 30
Bob 35

In [ ]:
df6.itertuples()